# Introduction to pandas

In [2]:
# The first step is to import the lib

import pandas as pd

# 1. Datatypes
- pandas has two main datatypes, Series and DataFrame.

- pandas.Series - a 1-dimensional column of data.
- pandas.DataFrame (most common) - a 2-dimesional table of data with rows and columns.
You can create a Series using pd.Series() and passing it a Python list.

In [7]:
# Note "S" of pd.series() should be in caps and values in list.

cars = pd.Series(["BMW","Toyota","Honda"])
cars

0       BMW
1    Toyota
2     Honda
dtype: object

In [9]:
# Another Example

Colors = pd.Series(["Blue","Red","Orange"])
Colors

0      Blue
1       Red
2    Orange
dtype: object

In [12]:
# DataFrame : Here "D" & "F" should be in caps and pd.DataFrame({}) values in 'dict'
# Syntax: 'col_name':'values'

car_data = pd.DataFrame({'Cars':cars,'Colors':Colors})
car_data

     Cars  Colors
0     BMW    Blue
1  Toyota     Red
2   Honda  Orange

In [13]:
# Importing Data
# NOTE: First you need to upload the File the same dir you're working in

car_sales = pd.read_csv("car-sales.csv")
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [25]:
# It'll show up in Notebook
# index : assing extra index so we put it to "false"
# Try without 'index'

exported_car_sales = car_sales.to_csv('exported-car-sales.csv',index = False)

In [26]:
# Directly run it

exported_car_sales = pd.read_csv('exported-car-sales.csv')
exported_car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

# Describing Data

In [28]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [33]:
# dtypes: Checks the datatype
car_sales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [40]:
# describe(): gives you a quick statistical overview of the numerical columns.
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [41]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [47]:
# mean()
# Note: Here data contains "$,." which computer doesn't understand
# So we Did "numeric_only = True (which means only numeric value)" 

# it's default is "False"
car_sales.mean() # Throw an error don't run it

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [49]:
car_sales.mean(numeric_only = True)

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [65]:
car_prices = pd.Series([3000,9000,6000])
car_prices.mean()

6000.0

In [52]:
# Calling .sum() on a DataFrame with numeric_only=False (default)
car_sales.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [51]:
car_sales.sum(numeric_only= True)

Odometer (KM)    786014
Doors                40
dtype: int64

In [62]:
car_sales["Doors"].sum()

40

In [63]:
len(car_sales)

10